import {AUTO_PRO} from './covid';
export const Comments = ({comments, setComments}) => {
  let arr1 = ['კვირაში ორჯერ', 'კვირაში ერთხელ', 'ორ კვირაში ერთხელ', 'თვეში ერთხელ'];
  let arr2 = ['0', '1', '2', '3', '4', '5'];
  return (
    <div className='radios'>
      <p className='intro'>
       რედბერის მთავარი ღირებულება ჩვენი გუნდის თითოეული წევრია. გარემო, რომელსაც ჩვენი
      თანამშრომლები ქმნით, ბევრისთვის არის და ყოფილა წლების განმავლობაში მიზნებისთვის ერთად ბრძოლის მიზეზი, ბევრისთვის კი — ჩვენთან გადმოსვლის.<br></br><br></br>
      პანდემიის პერიოდში ერთმანეთსაც იშვიათად ვნახულობთ პირისპირ და ყოველდღიური კომუნიკაციაც გაიშვიათდა.
      </p>
      {
        AUTO_PRO(arr1, 'ონლაინ_შეხვედრები', 'რა სიხშირით შეიძლება გვქონდეს საერთო არაფორმალური ონლაინ შეხვედრები, სადაც ყველა სურვილისამებრ ჩაერთვება?*', 'ონლაინ_შეხვედრები', comments, setComments)
      }
      {
        AUTO_PRO(arr2, 'ოფისიდან_მუშაობა', 'კვირაში რამდენი დღე ისურვებდი ოფისიდან მუშაობას?*', 'ოფისიდან_მუშაობა', comments, setComments)
      }
      <p className='question'>რას ფიქრობ ფიზიკურ შეკრებებზე?</p>
      <textarea></textarea>
      <p className='question'>რას ფიქრობ არსებულ გარემოზე: <br></br>
        რა მოგწონს, რას დაამატებდი, რას შეცვლიდი?
      </p>
      <textarea></textarea>
      <button className='submit'>დასრულება</button>
    </div>
  )
}
